// 1. Lysenko
//TODO: № 1 на if...else ===============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.

// const variable = 10;

// if (variable === 10) {
//     console.log('Вірно')
// } else {
//     console.log('Невірно');
// }

// 2. Slavinska
//TODO: № 2 на тернарник ===============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
// const variable = 5;

// console.log(variable === 10 ? "Вірно" : "Невірно");
// DmytroPod
//TODO: № 3 на if...else if ===============================================
// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).
// const min = 60;
// if (min >= 0 && min < 15) {
//   console.log("Число належить до першої четверті");
// } else if (min >= 15 && min < 30) {
//   console.log("Число належить до другої четверті");
// } else if (min >= 30 && min < 45) {
//   console.log("Число належить до третьої четверті");
// } else if (min >= 45 && min < 60) {
//   console.log("Число належить до четвертої четверті");
// } else {
//   console.log("немає такої четрверті");
// }
