// 1. Lysenko
//TODO: № 1 на if...else ===============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.

// const variable = 10;

// if (variable === 10) {
//     console.log('Вірно')
// } else {
//     console.log('Невірно');
// }

// 2. Slavinska
//TODO: № 2 на тернарник ===============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
// const variable = 5;

// console.log(variable === 10 ? "Вірно" : "Невірно");
